// Задача 3: Напишите программу, которая на вход принимает число 
// и выдаёт, является ли число чётным (делится ли оно на два без остатка).

int a = 10;

Console.Write(a);
    
if (a%2 == 0)
{
    Console.WriteLine(" является четным числом.");
}
else 
{
    Console.WriteLine(" НЕ является четным числом.");
}
